In [1]:
import sqlite3
import pandas as pd

In [4]:
db = "./mfa0.db"

In [5]:
%load_ext sql
%config SqlMagic.feedback=False
%sql sqlite:///{db}?check_same_thread=false
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///./mfa0.db?check_same_thread=false

[('collections',)]

In [4]:
# schema.sql
# CREATE TABLE "collections" (
# "id" INTEGER,
# "title" TEXTI NOT NULL,
# "accession_number" TEXT NOT NULL UNIQUE,
# "acquired" NUMERIC,
# PRIMARY KEY("id")
# );

In [5]:
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///./mfa0.db?check_same_thread=false

[('collections',)]

**Schema**

In [6]:
%sql SELECT sql FROM sqlite_master WHERE type='table';

 * sqlite:///./mfa0.db?check_same_thread=false

[('CREATE TABLE "collections" (\n"id" INTEGER,\n"title" TEXTI NOT NULL,\n"accession_number" TEXT NOT NULL UNIQUE,\n"acquired" NUMERIC,\nPRIMARY KEY("id")\n)',)]

In [7]:
# %%sql
# INSERT INTO "collections"
# ("id", "title", "accession_number", "acquired")
# VALUES
# (1, 'Profusion of flowers', '56.257', '1956-04-12');

In [8]:
%sql SELECT * FROM "collections";

 * sqlite:///./mfa0.db?check_same_thread=false

[(1, 'Profusion of flowers', '56.257', '1956-04-12'),
 (2, 'Farmers working at dawn', '11.6152', '1911-08-03'),
 (3, 'Imaginative landscape', '56.496', None),
 (4, 'Peonies and butterfly', '106.1899', '1906-01-01')]

In [9]:
# %%sql
# INSERT INTO "collections"
# (id, title, "accession_number", acquired)
# VALUES
# (2, 'Farmers working at dawn', '11.6152', '1911-08-03');

In [10]:
%sql SELECT * FROM "collections";

 * sqlite:///./mfa0.db?check_same_thread=false

[(1, 'Profusion of flowers', '56.257', '1956-04-12'),
 (2, 'Farmers working at dawn', '11.6152', '1911-08-03'),
 (3, 'Imaginative landscape', '56.496', None),
 (4, 'Peonies and butterfly', '106.1899', '1906-01-01')]

In [11]:
# %%sql
# INSERT INTO "collections"
# (id, title, "accession_number", "acquired")
# VALUES
# (3, 'Imaginative landscape', '56.496', NULL),
# (4, 'Peonies and butterfly', '106.1899','1906-01-01');

In [12]:
%sql SELECT * FROM "collections";

 * sqlite:///./mfa0.db?check_same_thread=false

[(1, 'Profusion of flowers', '56.257', '1956-04-12'),
 (2, 'Farmers working at dawn', '11.6152', '1911-08-03'),
 (3, 'Imaginative landscape', '56.496', None),
 (4, 'Peonies and butterfly', '106.1899', '1906-01-01')]

In [2]:
conn = sqlite3.connect("mfa.db")
cur = conn.cursor()

cur.execute("""
CREATE TABLE IF NOT EXISTS collections (
    id INTEGER PRIMARY KEY,
    title TEXT NOT NULL,
    accession_number TEXT NOT NULL UNIQUE,
    acquired NUMERIC
);
""")
conn.commit()

df = pd.read_csv("mfa.csv")
df.to_sql("collections", conn, if_exists="append", index=False)

5

In [6]:
%sql sqlite:///mfa.db?check_same_thread=false
%sql SELECT name FROM sqlite_master WHERE type='table';

   sqlite:///./mfa0.db?check_same_thread=false
 * sqlite:///mfa.db?check_same_thread=false

[('collections',)]

In [9]:
%sql SELECT * FROM "collections";

   sqlite:///./mfa0.db?check_same_thread=false
 * sqlite:///mfa.db?check_same_thread=false

[(1, 'Profusion of flowers', '56.257', '1956-04-12'),
 (2, 'Farmers working at dawn', '11.6152', '1911-08-03'),
 (3, 'Spring outing', '14.76', '1914-01-08'),
 (4, 'Imaginative landscape', '56.496', None),
 (5, 'Peonies and butterfly', '6.1899', '1906-01-01')]

In [11]:
%%sql
DELETE FROM "collections"
WHERE "acquired" < '1909-01-01';

   sqlite:///./mfa0.db?check_same_thread=false
 * sqlite:///mfa.db?check_same_thread=false

[]

In [12]:
%sql SELECT * FROM "collections";

   sqlite:///./mfa0.db?check_same_thread=false
 * sqlite:///mfa.db?check_same_thread=false

[(1, 'Profusion of flowers', '56.257', '1956-04-12'),
 (2, 'Farmers working at dawn', '11.6152', '1911-08-03'),
 (3, 'Spring outing', '14.76', '1914-01-08'),
 (4, 'Imaginative landscape', '56.496', None)]

In [13]:
%sql sqlite:///mfa1.db?check_same_thread=false
%sql SELECT name FROM sqlite_master WHERE type='table';

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
 * sqlite:///mfa1.db?check_same_thread=false

[('collections',), ('artists',), ('created',)]

In [17]:
conn = sqlite3.connect("mfa1.db")
cur = conn.cursor()

cur.executescript("""
INSERT INTO artists (id, name) VALUES
(1, 'Li Yin'),
(2, 'Qian Weicheng'),
(3, 'Unidentified artist'),
(4, 'Zhou Chen');

INSERT INTO collections (id, title, accession_number, acquired) VALUES
(1, 'Profusion of flowers', '56.257', '1956-04-12'),
(2, 'Farmers working at dawn', '11.6152', '1911-08-03'),
(3, 'Spring outing', '14.76', '1914-01-08'),
(4, 'Imaginative landscape', '56.496', NULL);

INSERT INTO created (artist_id, collection_id) VALUES
(2, 3),
(3, 1),
(1, 2),
(4, 4);
""")

conn.commit()

In [ ]:
%sql SELECT * FROM "collections";

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
 * sqlite:///mfa1.db?check_same_thread=false

[(1, 'Profusion of flowers', '56.257', '1956-04-12'),
 (2, 'Farmers working at dawn', '11.6152', '1911-08-03'),
 (3, 'Spring outing', '14.76', '1914-01-08'),
 (4, 'Imaginative landscape', '56.496', None)]

In [21]:
%sql SELECT * FROM "artists";

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
 * sqlite:///mfa1.db?check_same_thread=false

[(1, 'Li Yin'),
 (2, 'Qian Weicheng'),
 (3, 'Unidentified artist'),
 (4, 'Zhou Chen')]

In [20]:
%sql SELECT * FROM "created";

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
 * sqlite:///mfa1.db?check_same_thread=false

[(2, 3), (3, 1), (1, 2), (4, 4)]

In [26]:
%%sql
UPDATE "created" SET "artist_id" = (
    SELECT "id" FROM "artists"
    WHERE "name" = "Li Yin"
)
WHERE "collection_id" = (
    SELECT "id" FROM "collections"
    WHERE "title" = 'Profusion of flowers'
);

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
 * sqlite:///mfa1.db?check_same_thread=false

[]

In [27]:
%sql SELECT * FROM "created";

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
 * sqlite:///mfa1.db?check_same_thread=false

[(2, 3), (1, 1), (1, 2), (4, 4)]

In [29]:
%sql sqlite:///votes.db?check_same_thread=false
%sql SELECT name FROM sqlite_master WHERE type='table';

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///votes.db?check_same_thread=false

[('votes',)]

In [30]:
%sql SELECT * FROM "votes";

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///votes.db?check_same_thread=false

[('Farmers working at dawn',),
 ('Farmers Working at Dawn',),
 ('Imaginative landscape',),
 ('Profusion of flowers',),
 ('Spring outing',),
 (' Spring outing',),
 ('Imagintive landscape',),
 ('Farmesr working at dawn ',),
 ('Famers working at dawn',),
 ('Profusion',),
 ('Imaginative landscape',),
 ('Profusion of flowers',),
 ('Farmers working',),
 (' Imaginative landscape',),
 ('Imaginative  landscape',),
 ('Spring outing',),
 ('Spring outing',),
 ('Profusion of flowers',),
 ('SPring outing',),
 ('Farmers working at dawn ',)]

In [32]:
%%sql
SELECT "title", COUNT("title") AS "vote count"
FROM "votes"
GROUP BY "title";

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///votes.db?check_same_thread=false

[(' Imaginative landscape', 1),
 (' Spring outing', 1),
 ('Famers working at dawn', 1),
 ('Farmers Working at Dawn', 1),
 ('Farmers working', 1),
 ('Farmers working at dawn', 1),
 ('Farmers working at dawn ', 1),
 ('Farmesr working at dawn ', 1),
 ('Imaginative  landscape', 1),
 ('Imaginative landscape', 2),
 ('Imagintive landscape', 1),
 ('Profusion', 1),
 ('Profusion of flowers', 3),
 ('SPring outing', 1),
 ('Spring outing', 3)]

In [33]:
%%sql
UPDATE "votes" SET "title" = trim("title");

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///votes.db?check_same_thread=false

[]

In [34]:
%%sql
SELECT "title", COUNT("title") AS "vote count"
FROM "votes"
GROUP BY "title";

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///votes.db?check_same_thread=false

[('Famers working at dawn', 1),
 ('Farmers Working at Dawn', 1),
 ('Farmers working', 1),
 ('Farmers working at dawn', 2),
 ('Farmesr working at dawn', 1),
 ('Imaginative  landscape', 1),
 ('Imaginative landscape', 3),
 ('Imagintive landscape', 1),
 ('Profusion', 1),
 ('Profusion of flowers', 3),
 ('SPring outing', 1),
 ('Spring outing', 4)]

In [35]:
%%sql
UPDATE "votes" SET "title" = upper("title");

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///votes.db?check_same_thread=false

[]

In [36]:
%%sql
SELECT "title", COUNT("title") AS "vote count"
FROM "votes"
GROUP BY "title";

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///votes.db?check_same_thread=false

[('FAMERS WORKING AT DAWN', 1),
 ('FARMERS WORKING', 1),
 ('FARMERS WORKING AT DAWN', 3),
 ('FARMESR WORKING AT DAWN', 1),
 ('IMAGINATIVE  LANDSCAPE', 1),
 ('IMAGINATIVE LANDSCAPE', 3),
 ('IMAGINTIVE LANDSCAPE', 1),
 ('PROFUSION', 1),
 ('PROFUSION OF FLOWERS', 3),
 ('SPRING OUTING', 5)]

In [37]:
%%sql
UPDATE "votes" SET "title" = 'FARMERS WORKING AT DAWN'
WHERE "title" LIKE 'FA%WORKING%';

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///votes.db?check_same_thread=false

[]

In [38]:
%%sql
SELECT "title", COUNT("title") AS "vote count"
FROM "votes"
GROUP BY "title";

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///votes.db?check_same_thread=false

[('FARMERS WORKING AT DAWN', 6),
 ('IMAGINATIVE  LANDSCAPE', 1),
 ('IMAGINATIVE LANDSCAPE', 3),
 ('IMAGINTIVE LANDSCAPE', 1),
 ('PROFUSION', 1),
 ('PROFUSION OF FLOWERS', 3),
 ('SPRING OUTING', 5)]

In [39]:
%%sql
UPDATE "votes" SET "title" = 'IMAGINATIVE LANDSCAPE'
WHERE "title" LIKE 'IMAGIN%LANDSCAPE';

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///votes.db?check_same_thread=false

[]

In [40]:
%%sql
SELECT "title", COUNT("title") AS "vote count"
FROM "votes"
GROUP BY "title";

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///votes.db?check_same_thread=false

[('FARMERS WORKING AT DAWN', 6),
 ('IMAGINATIVE LANDSCAPE', 5),
 ('PROFUSION', 1),
 ('PROFUSION OF FLOWERS', 3),
 ('SPRING OUTING', 5)]

In [41]:
%%sql
UPDATE "votes" SET "title" = 'FARMERS WORKING AT DAWN'
WHERE "title" LIKE 'PROFUSION%';

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///votes.db?check_same_thread=false

[]

In [42]:
%%sql
SELECT "title", COUNT("title") AS "vote count"
FROM "votes"
GROUP BY "title";

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///votes.db?check_same_thread=false

[('FARMERS WORKING AT DAWN', 10),
 ('IMAGINATIVE LANDSCAPE', 5),
 ('SPRING OUTING', 5)]

In [43]:
%sql sqlite:///mfa2.db?check_same_thread=false
%sql SELECT name FROM sqlite_master WHERE type='table';

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///mfa2.db?check_same_thread=false
   sqlite:///votes.db?check_same_thread=false

[('collections',), ('artists',), ('created',)]

In [44]:
%%sql
CREATE TABLE "transactions" (
    "id" INTEGER,
    "title" TEXT,
    "action" TEXT,
    PRIMARY KEY("id")
);

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///mfa2.db?check_same_thread=false
   sqlite:///votes.db?check_same_thread=false

[]

In [45]:
%sql SELECT sql FROM sqlite_master WHERE type='table';

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///mfa2.db?check_same_thread=false
   sqlite:///votes.db?check_same_thread=false

[('CREATE TABLE "collections" (\n    "id" INTEGER PRIMARY KEY,\n    "title" TEXT NOT NULL,\n    "accession_number" TEXT NOT NULL UNIQUE,\n    "acquired" NUMERIC\n)',),
 ('CREATE TABLE "artists" (\n    "id" INTEGER PRIMARY KEY,\n    "name" TEXT NOT NULL\n)',),
 ('CREATE TABLE "created" (\n    "artist_id" INTEGER,\n    "collection_id" INTEGER,\n    PRIMARY KEY("artist_id", "collection_id"),\n    FOREIGN KEY("artist_id") REFERENCES "artists"("id") ON DELETE CASCADE,\n    FOREIGN KEY("collection_id") REFERENCES "collections"("id") ON DELETE CASCADE\n)',),
 ('CREATE TABLE "transactions" (\n    "id" INTEGER,\n    "title" TEXT,\n    "action" TEXT,\n    PRIMARY KEY("id")\n)',)]

In [47]:
%%sql
CREATE TRIGGER "sell"
BEFORE DELETE ON "collections"
FOR EACH ROW
BEGIN
    INSERT INTO "transactions" ("title", "action")
    VALUES (OLD."title", 'sold');
END;

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///mfa2.db?check_same_thread=false
   sqlite:///votes.db?check_same_thread=false

[]

In [48]:
%sql SELECT sql FROM sqlite_master WHERE type='table';

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///mfa2.db?check_same_thread=false
   sqlite:///votes.db?check_same_thread=false

[('CREATE TABLE "collections" (\n    "id" INTEGER PRIMARY KEY,\n    "title" TEXT NOT NULL,\n    "accession_number" TEXT NOT NULL UNIQUE,\n    "acquired" NUMERIC\n)',),
 ('CREATE TABLE "artists" (\n    "id" INTEGER PRIMARY KEY,\n    "name" TEXT NOT NULL\n)',),
 ('CREATE TABLE "created" (\n    "artist_id" INTEGER,\n    "collection_id" INTEGER,\n    PRIMARY KEY("artist_id", "collection_id"),\n    FOREIGN KEY("artist_id") REFERENCES "artists"("id") ON DELETE CASCADE,\n    FOREIGN KEY("collection_id") REFERENCES "collections"("id") ON DELETE CASCADE\n)',),
 ('CREATE TABLE "transactions" (\n    "id" INTEGER,\n    "title" TEXT,\n    "action" TEXT,\n    PRIMARY KEY("id")\n)',)]

In [49]:
%%sql
DELETE FROM "collections"
WHERE "title" = 'Profusion of flowers';

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///mfa2.db?check_same_thread=false
   sqlite:///votes.db?check_same_thread=false

[]

In [50]:
%sql SELECT * FROM "collections";

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///mfa2.db?check_same_thread=false
   sqlite:///votes.db?check_same_thread=false

[(1, 'Farmers working at dawn', '11.6152', '1911-08-03'),
 (2, 'Imaginative landscape', '56.496', None),
 (4, 'Spring outing', '14.76', '1914-01-08')]

In [51]:
%sql SELECT * FROM "transactions";

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///mfa2.db?check_same_thread=false
   sqlite:///votes.db?check_same_thread=false

[(1, 'Profusion of flowers', 'sold')]

In [52]:
%%sql
CREATE TRIGGER "buy"
AFTER INSERT ON "collections"
FOR EACH ROW
BEGIN
    INSERT INTO "transactions" ("title", "action")
    VALUES (NEW."title", 'bought');
END;

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///mfa2.db?check_same_thread=false
   sqlite:///votes.db?check_same_thread=false

[]

In [53]:
%%sql
INSERT INTO "collections" ("title", "accession_number", "acquired")
VALUES ('Profusion of flowers','56.247', '1956-04-12');

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///mfa2.db?check_same_thread=false
   sqlite:///votes.db?check_same_thread=false

[]

In [54]:
%sql SELECT * FROM "collections";

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///mfa2.db?check_same_thread=false
   sqlite:///votes.db?check_same_thread=false

[(1, 'Farmers working at dawn', '11.6152', '1911-08-03'),
 (2, 'Imaginative landscape', '56.496', None),
 (4, 'Spring outing', '14.76', '1914-01-08'),
 (5, 'Profusion of flowers', '56.247', '1956-04-12')]

In [55]:
%sql SELECT * FROM "transactions";

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///mfa2.db?check_same_thread=false
   sqlite:///votes.db?check_same_thread=false

[(1, 'Profusion of flowers', 'sold'), (2, 'Profusion of flowers', 'bought')]

In [56]:
%%sql
ALTER TABLE "collections"
ADD COLUMN "deleted" INTEGER DEFAULT 0;

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///mfa2.db?check_same_thread=false
   sqlite:///votes.db?check_same_thread=false

[]

In [57]:
%sql SELECT * FROM "collections";

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///mfa2.db?check_same_thread=false
   sqlite:///votes.db?check_same_thread=false

[(1, 'Farmers working at dawn', '11.6152', '1911-08-03', 0),
 (2, 'Imaginative landscape', '56.496', None, 0),
 (4, 'Spring outing', '14.76', '1914-01-08', 0),
 (5, 'Profusion of flowers', '56.247', '1956-04-12', 0)]

In [58]:
%%sql
UPDATE "collections"
SET "deleted" = 1
WHERE "title" = 'Farmers working at dawn';

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///mfa2.db?check_same_thread=false
   sqlite:///votes.db?check_same_thread=false

[]

In [59]:
%sql SELECT * FROM "collections";

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///mfa2.db?check_same_thread=false
   sqlite:///votes.db?check_same_thread=false

[(1, 'Farmers working at dawn', '11.6152', '1911-08-03', 1),
 (2, 'Imaginative landscape', '56.496', None, 0),
 (4, 'Spring outing', '14.76', '1914-01-08', 0),
 (5, 'Profusion of flowers', '56.247', '1956-04-12', 0)]

In [60]:
%sql SELECT * FROM "collections" WHERE "deleted" != 1;

   sqlite:///./mfa0.db?check_same_thread=false
   sqlite:///mfa.db?check_same_thread=false
   sqlite:///mfa1.db?check_same_thread=false
 * sqlite:///mfa2.db?check_same_thread=false
   sqlite:///votes.db?check_same_thread=false

[(2, 'Imaginative landscape', '56.496', None, 0),
 (4, 'Spring outing', '14.76', '1914-01-08', 0),
 (5, 'Profusion of flowers', '56.247', '1956-04-12', 0)]